{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_7x7_s2_weight", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_7x7_s2_bias", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_7x7_s2", 
      "attr": {
        "kernel": "(7, 7)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu_7x7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "pool1_norm1", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1.0", 
        "nsize": "5"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "conv2_norm2", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1.0", 
        "nsize": "5"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3a_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3a_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3a_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3a_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_3a_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[20, 0, 0], [28, 0, 0], [36, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_3b_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_3b_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_3b_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_3b_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_3b_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[46, 0, 0], [54, 0, 0], [62, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "208", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "208", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "208", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_4a_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4a_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4a_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4a_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4a_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_4a_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[73, 0, 0], [81, 0, 0], [89, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "224", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "224", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "224", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_4b_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4b_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4b_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4b_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4b_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_4b_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[99, 0, 0], [107, 0, 0], [115, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_4c_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4c_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4c_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4c_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4c_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_4c_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[125, 0, 0], [133, 0, 0], [141, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "112", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0], [152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[155, 0, 0], [156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_4d_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4d_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4d_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4d_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4d_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_4d_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[151, 0, 0], [159, 0, 0], [167, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "160", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_5x5_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_5x5_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_5x5_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_5x5_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_5x5_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_5x5_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_5x5", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_5x5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "inception_4e_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_4e_pool_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_4e_pool_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_4e_pool_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_4e_relu_pool_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "inception_4e_output", 
      "attr": {"num_args": "4"}, 
      "inputs": [[177, 0, 0], [185, 0, 0], [193, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4_3x3_s2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_5a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inception_5a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inception_5a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "inception_5a_relu_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inception_5a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
